Autodesk.Revit.DB.BuiltInFailures.SheetFailures.SheetNumberDuplicatedPerSheetCollection
Sheet Number is already in use. The same Sheet Number value can be used once for all sheets directly in the model, and once for all sheets per Sheet Collection.